Enterprise_Serivces/Prod/Bronze3/LoyaltyOrderService/result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/loyaltyprogram/contracts/2010/05/ILoyaltyOrderService/PlaceOrder</wsa:Action><wsa:MessageID>uuid:93b86cb5-27f5-4fef-8066-0f80faabca5d</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslloyaltyprogramservicesqa1.testgs.pvt/LoyaltyOrderService.svc</wsa:To></soap:Header><soap:Body><PlaceOrder xmlns="http://www.gamestop.com/services/csl/loyaltyprogram/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><Order xmlns="http://www.gamestop.com/services/csl/loyaltyprogram/contracts/messages/2010/11"><CustomerID xmlns="http://www.gamestop.com/services/csl/loyaltyprogram/contracts/entities/2010/11">1002771397</CustomerID><OrderItems xmlns="http://www.gamestop.com/services/csl/loyaltyprogram/contracts/entities/2010/11"><DraftOrderItem xmlns="http://www.gamestop.com/services/channel/loyalty/entities/2010/11"><CategoryType>Physical</CategoryType><ItemPoints>700</ItemPoints><Quantity>1</Quantity><RewardID>91247</RewardID><SKU>990004</SKU><SmallImageUrl>https://www.gamestop.com/gs/images/lpu/list/Lexar_4GB_SDHC.png</SmallImageUrl><Title>Lexar 4GB SDHC Card</Title></DraftOrderItem></OrderItems><ShipmentInfo xmlns="http://www.gamestop.com/services/csl/loyaltyprogram/contracts/entities/2010/11"><Address><AddressGuid>00000000-0000-0000-0000-000000000000</AddressGuid><AddressID xsi:nil="true" /><AddressLine1>8033 whitehart streetss</AddressLine1><AddressLine2>8033 whitehart sta</AddressLine2><AddressLine3 xsi:nil="true" /><AddressLine4 xsi:nil="true" /><AddressType>Shipping</AddressType><City>Dallas</City><CompanyName /><Country xsi:nil="true" /><County xsi:nil="true" /><FirstName>Test Man</FirstName><IsDefault>false</IsDefault><LastName>Tester</LastName><PostalCode>75249</PostalCode><StateOrProvince>TX</StateOrProvince></Address><Carrier>MailInnovations</Carrier><CarrierUrl>http://www.ups-mi.net/packageID/PackageID.aspx?PID=1ZMITEST287546</CarrierUrl><Email>test@gs.com</Email><ShipDate>2017-01-04T14:38:01</ShipDate><ShipmentNumber>862</ShipmentNumber><TrackingNumber>1ZMITEST287546</TrackingNumber></ShipmentInfo><TotalPoints xmlns="http://www.gamestop.com/services/csl/loyaltyprogram/contracts/entities/2010/11">700</TotalPoints></Order></request></PlaceOrder></soap:Body></soap:Envelope>